/** 
 ****************************************************************************************************					 
 * @file        delay.h
 * @version     V1.1
 * @brief       使用SysTick滴答定时器模式进行延时功能(支持ucosii)
 *              提供delay_init初始化函数，delay_us和delay_ms等延时函数 
 ****************************************************************************************************
 *
 * V1.1
 * 修改OS_SUPPORT_OS部分代码，默认仅支持UCOSII 2.93.01版本，其他OS请参考实现
 * 修改delay_init使用系统时钟
 * 修改delay_us使用时钟读取方法计时，兼容OS
 * 修改delay_ms直接使用delay_us计时实现.
 *
 ****************************************************************************************************
 */ 

#ifndef __DELAY_H
#define __DELAY_H
 
#include "./SYSTEM/sys/sys.h"


/********************************************************************************************/

void delay_init(uint16_t sysclk);       /* 初始化延时函数 */
void delay_ms(uint16_t nms);            /* 延时nms */
void delay_us(uint32_t nus);            /* 延时nus */

#endif