/**
 ****************************************************************************************************
 * @file        sys.h
 * @version     V1.0
 * @brief       一些系统相关的函数代码
 ****************************************************************************************************
 *
 * V1.0
 * 将头文件包含路径改成相对路径,避免重复包含路径的麻烦
 *
 ****************************************************************************************************
 */

#ifndef __SYS_H
#define __SYS_H

#include "gd32h7xx.h"


/**
 * SYS_SUPPORT_OS用于定义系统文件是否支持OS
 * 0,不支持OS
 * 1,支持OS
 */
#define SYS_SUPPORT_OS          0


/******************************************************************************************/

void sys_soft_reset(void);             /* 系统软复位 */
void sys_cache_enable(void);           /* 使能 Cache */

/* 以下为汇编函数 */
void sys_wfi_set(void);                /* 执行WFI指令 */
void sys_intx_disable(void);           /* 关闭所有中断 */
void sys_intx_enable(void);            /* 开启所有中断 */
void sys_msr_msp(uint32_t addr);       /* 设置堆栈顶部地址 */

#endif